# MinimumSampleHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..MinimumSampleHeight Property
CompoundStructure Class See Also
---
The minimum sample height determined by the current sample height and the horizontal segments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double MinimumSampleHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinimumSampleHeight As Double
	Get
```

Visual C++
---
```text
public:
property double MinimumSampleHeight {
	double get ();
}
```

# Remarks
All horizontal segments dimensioned to the top must remain strictly above all horizontal segments dimensioned to the bottom.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace